<?php

// 1. Даны два числа. Найти их сумму и произведение

$x = 5;
$y = 7;

echo $x + $y . " | " . $x * $y;
echo "<br />";

// 2. Даны два числа. Найдите сумму их квадратов.

$x = 5;
$y = 7;

echo ($x * $x) + ($y * $y);
echo "<br />";

// 3. Даны три числа. Найдите их среднее арифметическое.

$x = 5;
$y = 7;
$z = 12;

echo ($x + $y + $z)/3;
echo "<br />";

// 4. Даны три числа x,y и z. Найдите (x+1)4−2(z−2x2+y2)+1/2|siny|

function num($x, $y, $z) {
	return ( (($x + 1)*4) - 2*($z - (2*$x*$x) + ($y*$y)) + sqrt(sin($y)) );
}	

echo num(7, 3, 8);

